from datetime import date, timedelta

def daterange(start_date, final_date):
    """Генерирует даты из диапозона дат"""
    for n in range(int ((final_date - start_date).days)):
        yield start_date + timedelta(n)

start_date = date(year=2022, month=4, day=23)
end_date = date.today()

weekend = [date(year=2022, month=5, day=8)] + \
          [x for x in daterange(date(year=2022, month=8, day=1), 
                                date(year=2022, month=8, day=14) + timedelta(1))] + \
          [x for x in daterange(date(year=2022, month=12, day=31), 
                                date(year=2023, month=1, day=8) + timedelta(1))]

for single_date in daterange(start_date, end_date):
    if single_date in weekend:
        continue
    elif single_date.isoweekday() == 6 or single_date.isoweekday() == 7:
        print(f'1-я пара {single_date.strftime("%d/%m/%Y")}')
        print(f'2-я пара {single_date.strftime("%d/%m/%Y")}\n')

# stdout
# 1-я пара 23/04/2022
# 2-я пара 23/04/2022

# 1-я пара 24/04/2022
# 2-я пара 24/04/2022

# 1-я пара 30/04/2022
# 2-я пара 30/04/2022

# 1-я пара 01/05/2022
# 2-я пара 01/05/2022

# 1-я пара 07/05/2022
# 2-я пара 07/05/2022

# 1-я пара 14/05/2022
# 2-я пара 14/05/2022

# 1-я пара 15/05/2022
# 2-я пара 15/05/2022

# 1-я пара 21/05/2022
# 2-я пара 21/05/2022

# 1-я пара 22/05/2022
# 2-я пара 22/05/2022

# 1-я пара 28/05/2022
# 2-я пара 28/05/2022

# 1-я пара 29/05/2022
# 2-я пара 29/05/2022

# 1-я пара 04/06/2022
# 2-я пара 04/06/2022

# 1-я пара 05/06/2022
# 2-я пара 05/06/2022

# 1-я пара 11/06/2022
# 2-я пара 11/06/2022

# 1-я пара 12/06/2022
# 2-я пара 12/06/2022

# 1-я пара 18/06/2022
# 2-я пара 18/06/2022

# 1-я пара 19/06/2022
# 2-я пара 19/06/2022

# 1-я пара 25/06/2022
# 2-я пара 25/06/2022

# 1-я пара 26/06/2022
# 2-я пара 26/06/2022

# 1-я пара 02/07/2022
# 2-я пара 02/07/2022

# 1-я пара 03/07/2022
# 2-я пара 03/07/2022

# 1-я пара 09/07/2022
# 2-я пара 09/07/2022

# 1-я пара 10/07/2022
# 2-я пара 10/07/2022

# 1-я пара 16/07/2022
# 2-я пара 16/07/2022

# 1-я пара 17/07/2022
# 2-я пара 17/07/2022

# 1-я пара 23/07/2022
# 2-я пара 23/07/2022

# 1-я пара 24/07/2022
# 2-я пара 24/07/2022

# 1-я пара 30/07/2022
# 2-я пара 30/07/2022

# 1-я пара 31/07/2022
# 2-я пара 31/07/2022

# 1-я пара 20/08/2022
# 2-я пара 20/08/2022

# 1-я пара 21/08/2022
# 2-я пара 21/08/2022

# 1-я пара 27/08/2022
# 2-я пара 27/08/2022

# 1-я пара 28/08/2022
# 2-я пара 28/08/2022

# 1-я пара 03/09/2022
# 2-я пара 03/09/2022

# 1-я пара 04/09/2022
# 2-я пара 04/09/2022

# 1-я пара 10/09/2022
# 2-я пара 10/09/2022

# 1-я пара 11/09/2022
# 2-я пара 11/09/2022

# 1-я пара 17/09/2022
# 2-я пара 17/09/2022

# 1-я пара 18/09/2022
# 2-я пара 18/09/2022

# 1-я пара 24/09/2022
# 2-я пара 24/09/2022

# 1-я пара 25/09/2022
# 2-я пара 25/09/2022

# 1-я пара 01/10/2022
# 2-я пара 01/10/2022

# 1-я пара 02/10/2022
# 2-я пара 02/10/2022

# 1-я пара 08/10/2022
# 2-я пара 08/10/2022

# 1-я пара 09/10/2022
# 2-я пара 09/10/2022

# 1-я пара 15/10/2022
# 2-я пара 15/10/2022

# 1-я пара 16/10/2022
# 2-я пара 16/10/2022

# 1-я пара 22/10/2022
# 2-я пара 22/10/2022

# 1-я пара 23/10/2022
# 2-я пара 23/10/2022

# 1-я пара 29/10/2022
# 2-я пара 29/10/2022

# 1-я пара 30/10/2022
# 2-я пара 30/10/2022

# 1-я пара 05/11/2022
# 2-я пара 05/11/2022

# 1-я пара 06/11/2022
# 2-я пара 06/11/2022

# 1-я пара 12/11/2022
# 2-я пара 12/11/2022

# 1-я пара 13/11/2022
# 2-я пара 13/11/2022

# 1-я пара 19/11/2022
# 2-я пара 19/11/2022

# 1-я пара 20/11/2022
# 2-я пара 20/11/2022

# 1-я пара 26/11/2022
# 2-я пара 26/11/2022

# 1-я пара 27/11/2022
# 2-я пара 27/11/2022

# 1-я пара 03/12/2022
# 2-я пара 03/12/2022

# 1-я пара 04/12/2022
# 2-я пара 04/12/2022

# 1-я пара 10/12/2022
# 2-я пара 10/12/2022

# 1-я пара 11/12/2022
# 2-я пара 11/12/2022

# 1-я пара 17/12/2022
# 2-я пара 17/12/2022

# 1-я пара 18/12/2022
# 2-я пара 18/12/2022

# 1-я пара 24/12/2022
# 2-я пара 24/12/2022

# 1-я пара 25/12/2022
# 2-я пара 25/12/2022






