from random import choice

suits = ("черви", "бубны", "пики", "крести")

def card_deck():
    """Генерирует упорядоченную колоду карт"""
    for suit in suits:
        for denom in range(1, 14):
            yield denom, suit


def shuffle_deck():
    """Перемешивает упорядоченную колоду"""
    order_deck = list(card_deck())
    while order_deck:
        rand_card = choice(order_deck)
        order_deck.remove(rand_card)
        yield rand_card

q = card_deck()
print(next(q))
print(next(q))
print(next(q), '\n')
print(list(q), '\n\n')

y = shuffle_deck()
print(next(y))
print(next(y))
print(next(y), '\n')
print(list(y), '\n\n')


new_shuff_deck = list(shuffle_deck())
print('Перемешанная колода карт:', *new_shuff_deck, sep='\n')

# stdout

# (1, 'черви')
# (2, 'черви')
# (3, 'черви')

# [(4, 'черви'), (5, 'черви'), (6, 'черви'), (7, 'черви'), (8, 'черви'), (9, 'черви'), (10, 'черви'), (11, 'черви'), (12, 'черви'), (13, 'черви'), (1, 'бубны'), (2, 'бубны'), (3, 'бубны'), (4, 'бубны'), (5, 'бубны'), (6, 'бубны'), (7, 'бубны'), (8, 'бубны'), (9, 'бубны'), (10, 'бубны'), (11, 'бубны'), (12, 'бубны'), (13, 'бубны'), (1, 'пики'), (2, 'пики'), (3, 'пики'), (4, 'пики'), (5, 'пики'), (6, 'пики'), (7, 'пики'), (8, 'пики'), (9, 'пики'), (10, 'пики'), (11, 'пики'), (12, 'пики'), (13, 'пики'), (1, 'крести'), (2, 'крести'), (3, 'крести'), (4, 'крести'), (5, 'крести'), (6, 'крести'), (7, 'крести'), (8, 'крести'), (9, 'крести'), (10, 'крести'), (11, 'крести'), (12, 'крести'), (13, 'крести')]


# (4, 'крести')
# (3, 'черви')
# (11, 'черви')

# [(1, 'бубны'), (8, 'крести'), (9, 'черви'), (6, 'черви'), (8, 'бубны'), (12, 'крести'), (2, 'пики'), (13, 'черви'), (3, 'пики'), (11, 'крести'), (7, 'пики'), (6, 'пики'), (4, 'бубны'), (9, 'бубны'), (13, 'пики'), (7, 'черви'), (3, 'крести'), (1, 'крести'), (8, 'пики'), (8, 'черви'), (4, 'черви'), (10, 'крести'), (13, 'крести'), (5, 'черви'), (9, 'пики'), (7, 'крести'), (1, 'пики'), (13, 'бубны'), (10, 'пики'), (12, 'пики'), (10, 'бубны'), (11, 'бубны'), (6, 'крести'), (5, 'крести'), (12, 'бубны'), (5, 'бубны'), (4, 'пики'), (1, 'черви'), (11, 'пики'), (2, 'бубны'), (7, 'бубны'), (12, 'черви'), (9, 'крести'), (3, 'бубны'), (10, 'черви'), (2, 'крести'), (6, 'бубны'), (2, 'черви'), (5, 'пики')]


# Перемешанная колода карт:
# (8, 'черви')
# (6, 'пики')
# (4, 'черви')
# (10, 'бубны')
# (12, 'черви')
# (7, 'крести')
# (10, 'пики')
# (2, 'бубны')
# (9, 'бубны')
# (3, 'черви')
# (12, 'пики')
# (8, 'бубны')
# (1, 'черви')
# (9, 'пики')
# (11, 'крести')
# (1, 'пики')
# (13, 'пики')
# (7, 'бубны')
# (10, 'черви')
# (8, 'крести')
# (12, 'бубны')
# (10, 'крести')
# (7, 'черви')
# (11, 'черви')
# (9, 'черви')
# (6, 'черви')
# (5, 'черви')
# (6, 'бубны')
# (5, 'крести')
# (7, 'пики')
# (8, 'пики')
# (12, 'крести')
# (13, 'крести')
# (9, 'крести')
# (5, 'бубны')
# (1, 'бубны')
# (13, 'бубны')
# (3, 'крести')
# (2, 'крести')
# (6, 'крести')
# (5, 'пики')
# (1, 'крести')
# (4, 'пики')
# (4, 'крести')
# (2, 'черви')
# (3, 'пики')
# (4, 'бубны')
# (11, 'бубны')
# (2, 'пики')
# (13, 'черви')
# (11, 'пики')
# (3, 'бубны')



